In [ ]:
# Importando as

In [1]:
!pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in c:\programdata\anaconda3\lib\site-packages (4.9.1)
Requirement already satisfied: html5lib in c:\programdata\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: soupsieve>1.2 in c:\programdata\anaconda3\lib\site-packages (from beautifulsoup4) (2.0.1)
Requirement already satisfied: six>=1.9 in c:\programdata\anaconda3\lib\site-packages (from html5lib) (1.15.0)
Requirement already satisfied: webencodings in c:\programdata\anaconda3\lib\site-packages (from html5lib) (0.5.1)

In [2]:
import pandas as pd
import numpy as np
import requests
import json
import pycep_correios
from sqlalchemy import create_engine

# 1 - Lendo os arquivos

In [3]:
dados = pd.read_excel('dados-pessoais.xlsx')
dados_complementares = pd.read_csv('dados-complementares.csv', sep=',')

In [4]:
display(dados.head(), dados_complementares.head())

,Nome completo,RG,CPF,Data de aniversário,CEP,Dinheiro
0,Alberto Vieira,25.507.105-2,168.637.122-53,1997-07-01,64607-095,1142
1,Alexandre Teixeira,79.474.888-8,877.733.889-89,1982-08-16,59390-970,2279
2,Ana Carolina Souza,52.565.667-8,766.370.920-96,1982-03-19,68911-033,2928
3,Ana Paula Soares,54.744.331-9,746.917.734-52,1984-09-01,59104-345,3323
4,Antônio Siqueira,81.669.888-5,695.991.412-45,1990-07-26,25050-550,4233

   id                department    market      wage
0   1  Research and Development   Grocery  $2811.26
1   2  Research and Development     Shoes  $2623.82
2   3               Engineering  Clothing  $2694.60
3   4                  Services    Sports  $2587.09
4   5                   Support     Tools       NaN

# 2 - EXTRAÇÃO DE DADOS


Coletandos detalhes do endereço: **rua, bairro, cidade e estado**, através do CEP .

In [5]:
lista_ceps = dados.CEP
enderecos = []
for i in lista_ceps:

  url = f'https://viacep.com.br/ws/{i}/json/'
  resposta = requests.get(url)
  conteudo = resposta.content.decode('utf-8')
  endereco = json.loads(conteudo)
  enderecos.append(endereco)

- Verificando algum registro inconsitente.

In [6]:
for i in enderecos:
  if 'erro' in i:
    print(enderecos.index(i))

34

In [7]:
dados.loc[34].CEP

'57031-525'

- Pegando manualmente o endereço que apresentou erro

In [8]:
end_34 = pycep_correios.get_address_from_cep('57031-525')
end_34['localidade'] = end_34.pop('cidade')

In [9]:
end_34

{'bairro': 'Mangabeiras',
 'cep': '57031-525',
 'logradouro': 'Avenida Doutor Júlio Marques Luz - de 2210',
 'uf': 'AL',
 'complemento': '',
 'localidade': 'Maceió'}

- Alterando o elemento de indice 34 da lista

In [10]:
enderecos[34] = end_34

- Criando listas com os dados do endereço.

In [11]:
lista_logradouros = []
lista_complementos = []
lista_bairros = []
lista_cidades = []
lista_estados = []

for i in enderecos:
  end = i
  logradouro = end['logradouro']
  complemento = end['complemento']
  bairro = end['bairro']
  cidade = end['localidade']
  estado = end['uf']


  lista_logradouros.append(logradouro)
  lista_complementos.append(complemento)
  lista_bairros.append(bairro)
  lista_cidades.append(cidade)
  lista_estados.append(estado)

- **Adicionando novas colunas no dataframe referentes aos dados do endereço**

In [12]:
dados['rua'] = lista_logradouros
dados['complemento'] = lista_complementos
dados['bairro'] = lista_bairros
dados['cidade'] = lista_cidades
dados['estado'] = lista_estados 

dados.head()

,Nome completo,RG,CPF,Data de aniversário,CEP,Dinheiro,rua,complemento,bairro,cidade,estado
0,Alberto Vieira,25.507.105-2,168.637.122-53,1997-07-01,64607-095,1142,Travessa José Marinheiro,,Boa Sorte,Picos,PI
1,Alexandre Teixeira,79.474.888-8,877.733.889-89,1982-08-16,59390-970,2279,Rua Doutor Sílvio B. de Melo 279,,Centro,Lagoa Nova,RN
2,Ana Carolina Souza,52.565.667-8,766.370.920-96,1982-03-19,68911-033,2928,Rua Rio Japurà,(Cj. Res. Alfaville),Fazendinha,Macapá,AP
3,Ana Paula Soares,54.744.331-9,746.917.734-52,1984-09-01,59104-345,3323,Avenida das Fronteiras,até 503/504,Igapó,Natal,RN
4,Antônio Siqueira,81.669.888-5,695.991.412-45,1990-07-26,25050-550,4233,Travessa Purús,,Jardim Guanabara,Duque de Caxias,RJ

- **Separando os dados do nome**

In [13]:
# Pegando o nome 

nomes = []
for nome in dados['Nome completo']:
    objeto = nome
    objeto_lista = list(objeto.split(' '))
    objeto_lista.pop() 
    nomes.append(objeto_lista) 

nomes_2 = []
for i in nomes:
    if len(i) == 1:
        nome = i[0]
        nomes_2.append(nome)
    else:
        nome = i[0] + ' '+i[1]
        nomes_2.append(nome)
dados['nome'] = nomes_2

In [14]:
# pegando o sobrenome
teste = dados['Nome completo'].str.split(' ',n=2,expand=True)
dados['sobrenome'] = teste[2]
dados['sobrenome'] = dados['sobrenome'].fillna(teste[1])

In [15]:
dados.head()

,Nome completo,RG,CPF,Data de aniversário,CEP,Dinheiro,rua,complemento,bairro,cidade,estado,nome,sobrenome
0,Alberto Vieira,25.507.105-2,168.637.122-53,1997-07-01,64607-095,1142,Travessa José Marinheiro,,Boa Sorte,Picos,PI,Alberto,Vieira
1,Alexandre Teixeira,79.474.888-8,877.733.889-89,1982-08-16,59390-970,2279,Rua Doutor Sílvio B. de Melo 279,,Centro,Lagoa Nova,RN,Alexandre,Teixeira
2,Ana Carolina Souza,52.565.667-8,766.370.920-96,1982-03-19,68911-033,2928,Rua Rio Japurà,(Cj. Res. Alfaville),Fazendinha,Macapá,AP,Ana Carolina,Souza
3,Ana Paula Soares,54.744.331-9,746.917.734-52,1984-09-01,59104-345,3323,Avenida das Fronteiras,até 503/504,Igapó,Natal,RN,Ana Paula,Soares
4,Antônio Siqueira,81.669.888-5,695.991.412-45,1990-07-26,25050-550,4233,Travessa Purús,,Jardim Guanabara,Duque de Caxias,RJ,Antônio,Siqueira

In [16]:
dados.drop('Nome completo',axis=1,inplace=True)

In [17]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   RG                   50 non-null     object
 1   CPF                  50 non-null     object
 2   Data de aniversário  50 non-null     datetime64[ns]
 3   CEP                  50 non-null     object
 4   Dinheiro             50 non-null     int64
 5   rua                  50 non-null     object
 6   complemento          50 non-null     object
 7   bairro               50 non-null     object
 8   cidade               50 non-null     object
 9   estado               50 non-null     object
 10  nome                 50 non-null     object
 11  sobrenome            50 non-null     object
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 4.8+ KB

# 3 - Extração e tratamento dos dados (dólar)

- Verificando valores ausentes e o tipo das colunas do dataset **dados_complementares**

In [18]:
dados_complementares.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          50 non-null     int64
 1   department  50 non-null     object
 2   market      50 non-null     object
 3   wage        39 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.7+ KB

- Convertendo a coluna wage para o formato numérico.

In [19]:
dados_complementares['wage'] = pd.to_numeric(dados_complementares['wage'].str.split('$',n=2,expand=True)[1])

 - Tratando dados ausentes do dataset **dados_complementares**

In [20]:
dados_complementares['wage'] = dados_complementares['wage'].fillna(dados_complementares['wage'].mean())

In [21]:
dados_complementares.isnull().sum()

id            0
department    0
market        0
wage          0
dtype: int64

- Carregando os dados das taxas de conversão de acordo com o link.

In [22]:
table = pd.read_html('https://www.ecb.europa.eu/stats/policy_and_exchange_rates/euro_reference_exchange_rates/html/index.en.html')

In [23]:
taxas_cambio = table[0]

In [24]:
taxas_cambio.head()

  Currency     Currency.1      Spot  Chart
0      USD      US dollar    1.1986    NaN
1      JPY   Japanese yen  130.3700    NaN
2      BGN  Bulgarian lev    1.9558    NaN
3      CZK   Czech koruna   25.9270    NaN
4      DKK   Danish krone    7.4368    NaN

 - Fazendo a conversão monetária.

In [25]:
taxa_pais1 = float(taxas_cambio[taxas_cambio['Currency']=='BRL'].Spot)

taxa_pais2 = float(taxas_cambio[taxas_cambio['Currency']=='USD'].Spot)

taxa_de_conversao = taxa_pais1/taxa_pais2

In [26]:
dados_complementares['remuneracao'] = round(dados_complementares['wage']*taxa_de_conversao,3)
dados_complementares['wage'] = round(dados_complementares['wage'],3)

In [27]:
dados_complementares.head()

   id                department    market      wage  remuneracao
0   1  Research and Development   Grocery  2811.260    15808.353
1   2  Research and Development     Shoes  2623.820    14754.336
2   3               Engineering  Clothing  2694.600    15152.348
3   4                  Services    Sports  2587.090    14547.795
4   5                   Support     Tools  1834.799    10317.493

- Criando uma função que traduza os termos dos campos "department" e "market" para português (para esta ação, não é necessário o uso de API)

In [28]:
department_trad = ['Contabilidade','Desenvolvimento de negócios','Engenharia','Recursos Humanos',
                   'Juridico','Marketing','Gestão de produtos', 'Pesquisa e desenvolvimento','Vendas',
                   'Seviços', 'Suporte', 'Treinamento'] 

market_trad = ['Automotivo', 'Bebê','Beleza','Livros','Roupas','Eletrônicos','Jogos','Jardim',
               'Mercado', 'Saúde','Casa','Indústria','Jóias','Crianças','Filmes','Música','Ar livre','Tênis',
               'Esportes','Ferramentas','Brinquedos']

- Criando a função e aplicando no dataframe.

In [29]:
def traduzir_coluna(df,col,lista_trad):
    if col in df.columns:
        lista = list(df[col].unique())
        lista.sort()
        tradutor = dict(zip(lista, lista_trad))
    return tradutor

In [30]:
traduzir_coluna(dados_complementares,'department',department_trad)

{'Accounting': 'Contabilidade',
 'Business Development': 'Desenvolvimento de negócios',
 'Engineering': 'Engenharia',
 'Human Resources': 'Recursos Humanos',
 'Legal': 'Juridico',
 'Marketing': 'Marketing',
 'Product Management': 'Gestão de produtos',
 'Research and Development': 'Pesquisa e desenvolvimento',
 'Sales': 'Vendas',
 'Services': 'Seviços',
 'Support': 'Suporte',
 'Training': 'Treinamento'}

In [31]:
traduzir_coluna(dados_complementares,'market',market_trad)

{'Automotive': 'Automotivo',
 'Baby': 'Bebê',
 'Beauty': 'Beleza',
 'Books': 'Livros',
 'Clothing': 'Roupas',
 'Electronics': 'Eletrônicos',
 'Games': 'Jogos',
 'Garden': 'Jardim',
 'Grocery': 'Mercado',
 'Health': 'Saúde',
 'Home': 'Casa',
 'Industrial': 'Indústria',
 'Jewelery': 'Jóias',
 'Kids': 'Crianças',
 'Movies': 'Filmes',
 'Music': 'Música',
 'Outdoors': 'Ar livre',
 'Shoes': 'Tênis',
 'Sports': 'Esportes',
 'Tools': 'Ferramentas',
 'Toys': 'Brinquedos'}

In [32]:
dados_complementares['department'] = dados_complementares['department'].map(traduzir_coluna(dados_complementares,'department',department_trad))
dados_complementares['market'] = dados_complementares['market'].map(traduzir_coluna(dados_complementares,'market',market_trad))

- Vizualizando os dados após as transformações.

In [33]:
dados_complementares.head()

   id                  department       market      wage  remuneracao
0   1  Pesquisa e desenvolvimento      Mercado  2811.260    15808.353
1   2  Pesquisa e desenvolvimento        Tênis  2623.820    14754.336
2   3                  Engenharia       Roupas  2694.600    15152.348
3   4                     Seviços     Esportes  2587.090    14547.795
4   5                     Suporte  Ferramentas  1834.799    10317.493

## **Unindo os datasets**

In [34]:
dados_complementares.shape

(50, 5)

In [35]:
dados.shape

(50, 12)

In [36]:
dados_usuarios = pd.concat([dados_complementares, dados], axis=1, join='inner')

 - Reorganizando as colunas.

In [37]:
dados_usuarios.head()

,id,department,market,wage,remuneracao,RG,CPF,Data de aniversário,CEP,Dinheiro,rua,complemento,bairro,cidade,estado,nome,sobrenome
0,1,Pesquisa e desenvolvimento,Mercado,2811.260,15808.353,25.507.105-2,168.637.122-53,1997-07-01,64607-095,1142,Travessa José Marinheiro,,Boa Sorte,Picos,PI,Alberto,Vieira
1,2,Pesquisa e desenvolvimento,Tênis,2623.820,14754.336,79.474.888-8,877.733.889-89,1982-08-16,59390-970,2279,Rua Doutor Sílvio B. de Melo 279,,Centro,Lagoa Nova,RN,Alexandre,Teixeira
2,3,Engenharia,Roupas,2694.600,15152.348,52.565.667-8,766.370.920-96,1982-03-19,68911-033,2928,Rua Rio Japurà,(Cj. Res. Alfaville),Fazendinha,Macapá,AP,Ana Carolina,Souza
3,4,Seviços,Esportes,2587.090,14547.795,54.744.331-9,746.917.734-52,1984-09-01,59104-345,3323,Avenida das Fronteiras,até 503/504,Igapó,Natal,RN,Ana Paula,Soares
4,5,Suporte,Ferramentas,1834.799,10317.493,81.669.888-5,695.991.412-45,1990-07-26,25050-550,4233,Travessa Purús,,Jardim Guanabara,Duque de Caxias,RJ,Antônio,Siqueira

 - Criando a coluna Dinheiro dolar

In [38]:
taxa_pais1 = float(taxas_cambio[taxas_cambio['Currency']=='BRL'].Spot)

taxa_pais2 = float(taxas_cambio[taxas_cambio['Currency']=='USD'].Spot)

taxa_de_conversao2 = taxa_pais2/taxa_pais1

In [39]:
dados_usuarios['Dinheiro dolar'] = (dados_usuarios['Dinheiro']*taxa_de_conversao2)

- Reordenando e renomeando as colunas.

In [40]:
dados_usuarios.columns

Index(['id', 'department', 'market', 'wage', 'remuneracao', 'RG', 'CPF',
       'Data de aniversário', 'CEP', 'Dinheiro', 'rua', 'complemento',
       'bairro', 'cidade', 'estado', 'nome', 'sobrenome', 'Dinheiro dolar'],
      dtype='object')

In [41]:
dados_usuarios = dados_usuarios[['id','nome','sobrenome','RG', 'CPF',
       'Data de aniversário','rua', 'complemento','bairro', 'cidade', 'estado', 'CEP', 
        'Dinheiro', 'Dinheiro dolar','department', 'market','remuneracao','wage'
       ]]

In [42]:
dados_usuarios.columns = ['id_usuario', 'nome', 'sobrenome', 'RG', 'CPF', 'data_aniversario', 'logradouro',
                         'complemento', 'bairro', 'localidade', 'uf', 'CEP', 'dinheiro_real', 'dinheiro_dolar', 
                         'profissao', 'mercado', 'salario_real', 'salario_dolar']

In [43]:
dados_usuarios.head()

,id_usuario,nome,sobrenome,RG,CPF,data_aniversario,logradouro,complemento,bairro,localidade,uf,CEP,dinheiro_real,dinheiro_dolar,profissao,mercado,salario_real,salario_dolar
0,1,Alberto,Vieira,25.507.105-2,168.637.122-53,1997-07-01,Travessa José Marinheiro,,Boa Sorte,Picos,PI,64607-095,1142,203.086231,Pesquisa e desenvolvimento,Mercado,15808.353,2811.260
1,2,Alexandre,Teixeira,79.474.888-8,877.733.889-89,1982-08-16,Rua Doutor Sílvio B. de Melo 279,,Centro,Lagoa Nova,RN,59390-970,2279,405.283294,Pesquisa e desenvolvimento,Tênis,14754.336,2623.820
2,3,Ana Carolina,Souza,52.565.667-8,766.370.920-96,1982-03-19,Rua Rio Japurà,(Cj. Res. Alfaville),Fazendinha,Macapá,AP,68911-033,2928,520.697448,Engenharia,Roupas,15152.348,2694.600
3,4,Ana Paula,Soares,54.744.331-9,746.917.734-52,1984-09-01,Avenida das Fronteiras,até 503/504,Igapó,Natal,RN,59104-345,3323,590.941810,Seviços,Esportes,14547.795,2587.090
4,5,Antônio,Siqueira,81.669.888-5,695.991.412-45,1990-07-26,Travessa Purús,,Jardim Guanabara,Duque de Caxias,RJ,25050-550,4233,752.770593,Suporte,Ferramentas,10317.493,1834.799

# CRIAÇÃO DO BANCO DE DADOS




● Criar uma tabela no banco de dados para armazenar os dados Campos: id_usuario | nome | sobrenome | RG | CPF | data_aniversario logradouro | complemento | bairro | localidade | uf | CEP dinheiro_real | dinheiro_dolar profissao | mercado | salario_real | salario_dolar

In [45]:
! pip3 install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\programdata\anaconda3\lib\site-packages (8.0.23)
Requirement already satisfied: protobuf>=3.0.0 in c:\programdata\anaconda3\lib\site-packages (from mysql-connector-python) (3.15.8)
Requirement already satisfied: six>=1.9 in c:\programdata\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [46]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\programdata\anaconda3\lib\site-packages (1.0.2)

- CRIANDO A CONEXÃO COM BANCO DE DADOS E INSERINDO OS DADOS DATAFRAME EM UMA TABELA dados_usuarios"

In [53]:
engine = create_engine('mysql+pymysql://robertferro:a6ab12b6a162d10804d8df858432679a@jobs.**.com.br:3306/robertferro')

In [64]:
dados_usuarios.to_sql(
           name='dados_usuarios',
           con = engine, )